///////////////////////////////////////////////////////////////////////////////////
//Модуль - Sha3 (Keccak) Клиент Сервер
//
//
// MIT License Copyright (c) 2020 AcrylPlatform.
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights 
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell 
// copies of the Software, and to permit persons to whom the Software 
// is furnished to do so, subject to the following conditions:
// The above copyright notice and this permission notice shall be 
// included in all copies or substantial portions of the Software.
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
// EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, 
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT 
// SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, 
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, 
// ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE 
// OR OTHER DEALINGS IN THE SOFTWARE.
//
//
// [js-sha3]{@link https://github.com/emn178/js-sha3}
//
// @version 0.5.7
// @author Chen, Yi-Cyuan [emn178@gmail.com]
// @copyright Chen, Yi-Cyuan 2015-2016
// @license MIT
//
// Ported to 1C in 2019 by Artyom Serov
//
///////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////
#Область СлужебныеПроцедурыИФункции

///////////////////////////////////////////////////////////////////////////////////
#Область ОберткаОбщихФункций

Функция ПобитовыйСдвигВправоБеззнаковый(Число, Смещение)
	
	Возврат Crypt_ОбщегоНазначенияКлиентСевер.ПобитовыйСдвигВправоСЗаполнениемНулями(Число, Смещение);
	
КонецФункции

Функция пСдвигВЛево(Число, Смещение, Разрядность = 32, Беззнаковое = Ложь) 
	
	Возврат Crypt_ОбщегоНазначенияКлиентСевер.пСдвигВЛево(Число, Смещение, Разрядность, Беззнаковое);
	
КонецФункции

Функция пСдвигВПраво(Число, Смещение, Разрядность = 32, Беззнаковое = Ложь) 
	
	Возврат Crypt_ОбщегоНазначенияКлиентСевер.пСдвигВПраво(Число, Смещение, Разрядность, Беззнаковое);
	
КонецФункции

Функция пИсключительноеИли(Число1, Число2, Разрядность = 32, Беззнаковое = Ложь)

	Возврат Crypt_ОбщегоНазначенияКлиентСевер.пИсключительноеИли(Число1, Число2, Разрядность, Беззнаковое);
	
КонецФункции	

Функция пИ(Число1, Число2, Разрядность = 32, Беззнаковое = Ложь)  
	
	Возврат Crypt_ОбщегоНазначенияКлиентСевер.пИ(Число1, Число2, Разрядность, Беззнаковое);
	
КонецФункции

Функция пИли(Число1, Число2, Разрядность = 32, Беззнаковое = Ложь) 
	
	Возврат Crypt_ОбщегоНазначенияКлиентСевер.пИли(Число1, Число2, Разрядность, Беззнаковое);
	
КонецФункции

Функция пНе(Число, Разрядность = 32, Беззнаковое = Ложь)  
	
	Возврат Crypt_ОбщегоНазначенияКлиентСевер.пНе(Число, Разрядность, Беззнаковое);
	
КонецФункции

Функция ПреведениеКДиапазону(Знач ТипизированныйМассив, Знач Число) Экспорт 
	
	Возврат Crypt_ТипизированныеМассивы.ПреведениеКДиапазону(ТипизированныйМассив, Число);
	
КонецФункции

#КонецОбласти
///////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////
#Область Keccak

Функция Init() 

	HEX_CHARS = Новый Массив;
	HEX_CHARS.Добавить("0");
	HEX_CHARS.Добавить("1");
	HEX_CHARS.Добавить("2");
	HEX_CHARS.Добавить("3");
	HEX_CHARS.Добавить("4");
	HEX_CHARS.Добавить("5");
	HEX_CHARS.Добавить("6");
	HEX_CHARS.Добавить("7");
	HEX_CHARS.Добавить("8");
	HEX_CHARS.Добавить("9");
	HEX_CHARS.Добавить("a");
	HEX_CHARS.Добавить("b");
	HEX_CHARS.Добавить("c");
	HEX_CHARS.Добавить("d");
	HEX_CHARS.Добавить("e");
	HEX_CHARS.Добавить("f");
	
	SHAKE_PADDING = Новый Массив;
	SHAKE_PADDING.Добавить(31);
	SHAKE_PADDING.Добавить(7936);
	SHAKE_PADDING.Добавить(2031616);
	SHAKE_PADDING.Добавить(520093696);
	
	KECCAK_PADDING = Новый Массив;
	KECCAK_PADDING.Добавить(1);
	KECCAK_PADDING.Добавить(256);
	KECCAK_PADDING.Добавить(65536);
	KECCAK_PADDING.Добавить(16777216);
	
	PADDING = Новый Массив;
	
	PADDING.Добавить(6);
	PADDING.Добавить(1536);
	PADDING.Добавить(393216);
	PADDING.Добавить(100663296);
	
	SHIFT = Новый Массив;
	SHIFT.Добавить(0);
	SHIFT.Добавить(8);
	SHIFT.Добавить(16);
	SHIFT.Добавить(24);
	
	RC = Новый Массив;
	
	RC.Добавить(1);
	RC.Добавить(0);
	RC.Добавить(32898);
	RC.Добавить(0);
	RC.Добавить(32906);
	RC.Добавить(2147483648);
	RC.Добавить(2147516416);
	RC.Добавить(2147483648);
	RC.Добавить(32907);
	RC.Добавить(0);
	RC.Добавить(2147483649);
	RC.Добавить(0);
	RC.Добавить(2147516545);
	RC.Добавить(2147483648);
	RC.Добавить(32777);
	RC.Добавить(2147483648);
	RC.Добавить(138);
	RC.Добавить(0);
	RC.Добавить(136);
	RC.Добавить(0);
	RC.Добавить(2147516425);
	RC.Добавить(0);
	RC.Добавить(2147483658);
	RC.Добавить(0);
	RC.Добавить(2147516555);
	RC.Добавить(0);
	RC.Добавить(139);
	RC.Добавить(2147483648);
	RC.Добавить(32905);
	RC.Добавить(2147483648);
	RC.Добавить(32771);
	RC.Добавить(2147483648);
	RC.Добавить(32770);
	RC.Добавить(2147483648);
	RC.Добавить(128);
	RC.Добавить(2147483648);
	RC.Добавить(32778);
	RC.Добавить(0);
	RC.Добавить(2147483658);
	RC.Добавить(2147483648);
	RC.Добавить(2147516545);
	RC.Добавить(2147483648);
	RC.Добавить(32896);
	RC.Добавить(2147483648);
	RC.Добавить(2147483649);
	RC.Добавить(0);
	RC.Добавить(2147516424);
	RC.Добавить(2147483648);
	
	SHAKE_BITS = Новый Массив;
	SHAKE_BITS.Добавить(128);
	SHAKE_BITS.Добавить(256);
	
	OUTPUT_TYPES = Новый Массив;
	
	OUTPUT_TYPES.Добавить("hex");
	OUTPUT_TYPES.Добавить("buffer");
	OUTPUT_TYPES.Добавить("arrayBuffer");
	OUTPUT_TYPES.Добавить("array");
	
	Результат = Новый Структура;
	Результат.Вставить("HEX_CHARS", HEX_CHARS);
	Результат.Вставить("SHAKE_PADDING", SHAKE_PADDING);
	Результат.Вставить("KECCAK_PADDING", KECCAK_PADDING);
	Результат.Вставить("PADDING", PADDING);
	Результат.Вставить("SHIFT", SHIFT);
	Результат.Вставить("RC", RC);
	//Результат.Вставить("BITS", BITS);
	Результат.Вставить("SHAKE_BITS", SHAKE_BITS);
	Результат.Вставить("OUTPUT_TYPES", OUTPUT_TYPES);
	
	Возврат Результат;
	
КонецФункции

Функция Keccak(bits = 256, outputBits = 256)
	
	this = новый Структура;
	
	СтруктураПараметров = Init();
	
	this.Вставить("outputBits", outputBits);
	this.Вставить("blocks", Crypt_ТипизированныеМассивы.Int32Array("blocks"));
	this.Вставить("s", Crypt_ТипизированныеМассивы.Int32Array("s", 50));
	
	this.Вставить("padding", СтруктураПараметров.KECCAK_PADDING);
	
	this.Вставить("reset", Истина);
	
	this.Вставить("block", 0);
	this.Вставить("start", 0);
	
	this.Вставить("blockCount", ПобитовыйСдвигВправо(1600 - (ПобитовыйСдвигВлево(bits, 1)), 5));
	this.Вставить("byteCount", ПобитовыйСдвигВлево(this.blockCount, 2));
	this.Вставить("outputBlocks", ПобитовыйСдвигВправо(outputBits, 5));
	this.Вставить("extraBytes", ПобитовыйСдвигВправо(ПобитовоеИ(outputBits, 31), 3));
	
	this.Вставить("SHIFT", СтруктураПараметров.SHIFT);
	
	this.Вставить("RC", СтруктураПараметров.RC);
	
	Для i = 0 По 49 Цикл 
		
		this.s.s[i] = 0;
		
	КонецЦикла; 
	
		
	Возврат this;
	
КонецФункции

Функция Keccakfinalize(this)
	
	blocks = this.blocks.blocks;
	
	i = this.lastByteIndex;
	blockCount = this.blockCount;
	s = this.s.s;
	
	blocks[ПобитовыйСдвигВправо(i, 2)] = ПреведениеКДиапазону(this.blocks,
		ПобитовоеИли(blocks[ПобитовыйСдвигВправо(i, 2)],
		this.padding[ПобитовоеИ(i, 3)]));
		
		
	Если this.lastByteIndex = this.byteCount Тогда 	
	
		blocks[0] = ПреведениеКДиапазону(this.blocks, blocks[blockCount]);
		
		Для i = 1 По blockCount + 1 Цикл
		
			blocks[i] = 0;	
			
		КонецЦикла;
	
	КонецЕсли;
	
	blocks[blockCount - 1] = ПреведениеКДиапазону(this.blocks, ПобитовоеИли(blocks[blockCount - 1], 2147483648));
	
	Для i = 0 По  blockCount Цикл 
		
		s[i] = blocks[i];
		
	КонецЦикла;
	
	f(this.s, this.RC);
	
	extraBytes = this.extraBytes;
	outputBlocks = this.outputBlocks;
	
	array_t = Crypt_ТипизированныеМассивы.Uint8Array("array");
	
	array = array_t.array;
	
	j = 0;
	
	Пока j < outputBlocks Цикл 
		
		i = 0;
		
		Пока i < blockCount и j < outputBlocks Цикл 
			
		    offset = пСдвигВЛево(j, 2);
		    block = s[i];
			
			Если (array.Количество() - 1) < offset Тогда
				
				array.Вставить(offset, 0);
				
			КонецЕсли;
			
		    array[offset] = ПреведениеКДиапазону(array_t, пИ(block, 255));
			
			Если (array.Количество() - 1) < offset + 1 Тогда
				
				array.Вставить(offset + 1, 0);
				
			КонецЕсли;
			
		    array[offset + 1] = ПреведениеКДиапазону(array_t, пИ(пСдвигВПраво(block, 8), 255));
			
			Если (array.Количество() - 1) < offset + 2 Тогда
				
				array.Вставить(offset + 2, 0);
				
			КонецЕсли;
			
		    array[offset + 2] = ПреведениеКДиапазону(array_t, пИ(пСдвигВПраво(block, 16), 255));
			
			Если (array.Количество() - 1) < offset + 3 Тогда
				
				array.Вставить(offset + 3, 0);
				
			КонецЕсли;

		    array[offset + 3] = ПреведениеКДиапазону(array_t, пИ(пСдвигВПраво(block, 24), 255));

			  
			i = i + 1;
			j = j + 1;
			  
		КонецЦикла;
		  
		Если (j % blockCount) = 0 Тогда 
			
			f(this.s, this.RC);
			
		КонецЕсли;
			 		
	КонецЦикла;
	
	Если extraBytes = 1 Тогда 
		
		offset = пСдвигВЛево(j, 2);
   		block = s[i];
			
	
		Если extraBytes > 0 Тогда
			
			Если (array.Количество() - 1) < offset Тогда
				
				array.Вставить(offset, 0);
				
			КонецЕсли;
		
			array[offset] = ПреведениеКДиапазону(array_t, пИ(block, 255));
			
		КонецЕсли;
		
		Если extraBytes > 1 Тогда
			
			Если (array.Количество() - 1) < offset + 1 Тогда
				
				array.Вставить(offset + 1, 0);
				
			КонецЕсли;
			
			array[offset + 1] = ПреведениеКДиапазону(array_t, пИ(пСдвигВПраво(block, 8), 255));
    
		КонецЕсли;
		
		Если extraBytes > 2 Тогда 
			
			Если (array.Количество() - 1) < offset + 2 Тогда
				
				array.Вставить(offset + 2, 0);
				
			КонецЕсли;
			
			array[offset + 2] = ПреведениеКДиапазону(array_t, пИ(пСдвигВПраво(block, 16), 255));
			
		КонецЕсли;
   
	КонецЕсли;
	
	Возврат array_t;
	
КонецФункции

Процедура f(intArray_s, RC)
	
	s = intArray_s.s;
	
	n = 0;
	
	Пока n < 48 Цикл
	
		c0 = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
				ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
					ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
						ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[0], s[10])), s[20])), s[30])), s[40]));

		c1 = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
				ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
					ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
						ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[1], s[11])), s[21])), s[31])), s[41]));

		c2 = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
				ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
					ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
						ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[2], s[12])), s[22])), s[32])), s[42]));

		c3 = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
				ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
					ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
						ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[3], s[13])), s[23])), s[33])), s[43]));

		c4 = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
				ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
					ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
						ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[4], s[14])), s[24])), s[34])), s[44]));

		c5 = пИсключительноеИли(
				пИсключительноеИли(
					пИсключительноеИли(
						пИсключительноеИли(s[5], s[15]), s[25]), s[35]), s[45]);

		c6 = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
				ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
					ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
						ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[6], s[16])), s[26])), s[36])), s[46]));

		c7 = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
				ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
					ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
						ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[7], s[17])), s[27])), s[37])), s[47]));

		c8 = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
				ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
					ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
						ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[8], s[18])), s[28])), s[38])), s[48]));

		c9 = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
				ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
					ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
						ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[9], s[19])), s[29])), s[39])), s[49]));

		
		h = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c8,
			    ПреведениеКДиапазону(intArray_s, пИли(
	          		ПреведениеКДиапазону(intArray_s, пСдвигВлево(c2, 1)),
	           		ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c3, 31))))));
			
		l = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c9,
			    ПреведениеКДиапазону(intArray_s, пИли(
	          		ПреведениеКДиапазону(intArray_s, пСдвигВлево(c3, 1)),
	           		ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c2, 31))))));
				

	    s[0] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[0], h));
	    s[1] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[1], l));
	    s[10] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[10], h));
	    s[11] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[11], l));
	    s[20] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[20], h));
	    s[21] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[21], l));
	    s[30] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[30], h));
	    s[31] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[31], l));
	    s[40] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[40], h));
	    s[41] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[41], l));

	    h = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c0, 
	          ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(c4, 1)), 
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c5, 31))))));
	              
	    l = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c1, 
	          ПреведениеКДиапазону(intArray_s, пИсключительноеИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(c5, 1)), 
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c4, 31))))));

	    s[2] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[2], h));
	    s[3] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[3], l));
	    s[12] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[12], h));
	    s[13] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[13], l));
	    s[22] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[22], h));
	    s[23] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[23], l));
	    s[32] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[32], h));
	    s[33] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[33], l));
	    s[42] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[42], h));
	    s[43] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[43], l));

	    h = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c2,
	          ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(c6, 1)), 
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c7, 31))))));
	    l = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c3,
	          ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(c7, 1)), 
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c6, 31))))));

	    s[4] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[4], h));
	    s[5] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[5], l));
	    s[14] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[14], h));
	    s[15] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[15], l));
	    s[24] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[24], h));
	    s[25] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[25], l));
	    s[34] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[34], h));
	    s[35] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[35], l));
	    s[44] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[44], h));
	    s[45] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[45], l));

	    h = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c4,
	          ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(c8, 1)), 
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c9, 31))))));

	    l = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c5,
	          ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(c9, 1)), 
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c8, 31))))));

	    s[6] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[6], h));
	    s[7] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[7], l));
	    s[16] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[16], h));
	    s[17] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[17], l));
	    s[26] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[26], h));
	    s[27] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[27], l));
	    s[36] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[36], h));
	    s[37] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[37], l));
	    s[46] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[46], h));
	    s[47] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[47], l));

	    h = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c6,
	          ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(c0, 1)), 
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c1, 31))))));
	    l = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(c7,
	          ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(c1, 1)), 
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(c0, 31))))));

	    s[8] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[8], h));
	    s[9] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[9], l));
	    s[18] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[18], h));
	    s[19] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[19], l));
	    s[28] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[28], h));
	    s[29] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[29], l));
	    s[38] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[38], h));
	    s[39] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[39], l));
	    s[48] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[48], h));
	    s[49] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[49], l));

	    b0 = ПреведениеКДиапазону(intArray_s, s[0]);
	    b1 = ПреведениеКДиапазону(intArray_s, s[1]);

	    b32 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[11], 4)), 
	             ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[10], 28))));
	    b33 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[10], 4)), 
	             ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[11], 28))));
	    b14 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[20], 3)), 
	             ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[21], 29))));
	    b15 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[21], 3)), 
	             ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[20], 29))));
	    b46 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[31], 9)), 
	             ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[30], 23))));
	    b47 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[30], 9)), 
	             ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[31], 23))));
	    b28 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[40], 18)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[41], 14))));
	    b29 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[41], 18)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[40], 14))));
	    b20 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[2] ,  1)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[3] , 31))));
	    b21 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[3] ,  1)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[2] , 31))));
	    b2 =  ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[13], 12)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[12], 20))));
	    b3 =  ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[12], 12)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[13], 20))));
	    b34 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[22], 10)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[23], 22))));
	    b35 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[23], 10)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[22], 22))));
	    b16 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[33], 13)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[32], 19))));
	    b17 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[32], 13)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[33], 19))));
	    b48 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[42],  2)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[43], 30))));
	    b49 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[43],  2)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[42], 30))));   
	    b40 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[5] , 30)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[4] , 2 ))));
	    b41 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[4] , 30)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[5] , 2 ))));
	    b22 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[14], 6 )),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[15], 26))));
	    b23 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[15], 6 )),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[14], 26))));
	    b4 =  ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[25], 11)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[24], 21))));
	    b5 =  ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[24], 11)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[25], 21))));
	    b36 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[34], 15)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[35], 17))));
	    b37 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[35], 15)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[34], 17))));
	    b18 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[45], 29)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[44],  3))));
	    b19 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[44], 29)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[45],  3))));
	    b10 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[6] , 28)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[7] ,  4))));
	    b11 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[7] , 28)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[6] ,  4))));
	    b42 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[17], 23)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[16],  9))));
	    b43 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[16], 23)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[17],  9))));
	    b24 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[26], 25)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[27],  7))));
	    b25 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[27], 25)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[26],  7))));
	    b6 =  ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[36], 21)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[37], 11))));
	    b7 =  ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[37], 21)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[36], 11))));
	    b38 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[47], 24)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[46],  8))));
	    b39 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[46], 24)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[47],  8))));
	    b30 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[8] , 27)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[9] ,  5))));
	    b31 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[9] , 27)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[8] ,  5))));
	    b12 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[18], 20)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[19], 12))));
	    b13 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[19], 20)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[18], 12))));
	    b44 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[29],  7)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[28], 25))));
	    b45 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[28],  7)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[29], 25))));
	    b26 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[38],  8)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[39], 24))));
	    b27 = ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[39],  8)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[38], 24))));
	    b8 =  ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[48], 14)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[49], 18))));
	    b9 =  ПреведениеКДиапазону(intArray_s, пИли(
	            ПреведениеКДиапазону(intArray_s, пСдвигВлево(s[49], 14)),
	              ПреведениеКДиапазону(intArray_s, ПобитовыйСдвигВправоБеззнаковый(s[48], 18))));


	   s[0]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b0  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b2 )), b4 ))));
	       
	    s[1]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b1  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b3 )), b5 ))));
	       
	    s[10] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b10 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b12)), b14))));
	       
	    s[11] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b11 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b13)), b15))));
	       
	    s[20] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b20 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b22)), b24))));
	       
	    s[21] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b21 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b23)), b25))));
	       
	    s[30] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b30 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b32)), b34))));
	       
	    s[31] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b31 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b33)), b35))));
	       
	    s[40] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b40 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b42)), b44))));
	       
	    s[41] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b41 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b43)), b45))));
	       
	    s[2]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b2  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b4 )), b6 ))));
	       
	    s[3]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b3  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b5 )), b7 ))));
	       
	    s[12] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b12 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b14)), b16))));
	       
	    s[13] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b13 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b15)), b17))));
	       
	    s[22] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b22 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b24)), b26))));
	       
	    s[23] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b23 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b25)), b27))));
	       
	    s[32] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b32 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b34)), b36))));
	       
	    s[33] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b33 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b35)), b37))));
	       
	    s[42] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b42 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b44)), b46))));
	       
	    s[43] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b43 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b45)), b47))));
	       
	    s[4]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b4  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b6 )), b8 ))));
	       
	    s[5]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b5  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b7 )), b9 ))));
	       
	    s[14] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b14 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b16)), b18))));
	       
	    s[15] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b15 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b17)), b19))));
	       
	    s[24] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b24 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b26)), b28))));
	       
	    s[25] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b25 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b27)), b29))));
	       
	    s[34] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b34 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b36)), b38))));
	       
	    s[35] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b35 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b37)), b39))));
	       
	    s[44] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b44 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b46)), b48))));
	       
	    s[45] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b45 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b47)), b49))));
	       
	    s[6]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b6  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b8 )), b0 ))));
	       
	    s[7]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b7  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b9 )), b1 ))));
	       
	    s[16] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b16 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b18)), b10))));
	       
	    s[17] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b17 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b19)), b11))));
	       
	    s[26] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b26 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b28)), b20))));
	       
	    s[27] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b27 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b29)), b21))));
	       
	    s[36] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b36 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b38)), b30))));
	       
	    s[37] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b37 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b39)), b31))));
	       
	    s[46] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b46 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b48)), b40))));
	       
	    s[47] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b47 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b49)), b41))));
	       
	    s[8]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b8  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b0 )), b2 ))));
	       
	    s[9]  = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b9  ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b1 )), b3 ))));
	       
	    s[18] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b18 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b10)), b12))));
	       
	    s[19] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b19 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b11)), b13))));
	       
	    s[28] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b28 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b20)), b22))));
	       
	    s[29] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b29 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b21)), b23))));
	       
	    s[38] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b38 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b30)), b32))));
	       
	    s[39] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b39 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b31)), b33))));
	       
	    s[48] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b48 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b40)), b42))));
	       
	    s[49] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(b49 ,
	     ПреведениеКДиапазону(intArray_s, пИ(
	       ПреведениеКДиапазону(intArray_s, пНе(b41)), b43))));
		   
		s[0] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[0], RC[n]));
	    s[1] = ПреведениеКДиапазону(intArray_s, пИсключительноеИли(s[1], RC[n + 1]));   
		
		
		n = n + 2;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
////////////////////////////////////////////////////////////////////////////////////
 
#КонецОбласти
////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция KeccakUpdate(message, arrayname = Неопределено) Экспорт 
	
	Если ТипЗнч(message) = ТипЗнч("") Тогда
		
		notString = Ложь;
		
		messagearray = Crypt_Utf8.СтрокаВUtf8МассивБайт(message); 
		
	ИначеЕсли ТипЗнч(message) = ТипЗнч(Новый Структура)
		    И arrayname <> Неопределено Тогда 
			
		notString = Истина;
			
		messagearray = message[arrayname];
		
	ИначеЕсли ТипЗнч(message) = ТипЗнч(Новый Структура)
		    И arrayname = Неопределено Тогда 
			
		notString = Истина;
			
		messagearray = Crypt_ТипизированныеМассивы.ПолучитьДанныеМассива(message);
		
	ИначеЕсли ТипЗнч(message) = ТипЗнч(Новый Массив) Тогда 	
		
		notString = Истина;
		
	Иначе
		
		ВызватьИсключение "Input must be an String or Array";
			
	КонецЕсли;
	
	this = Keccak();
	
	length = messagearray.Количество();
	
	blocks = this.blocks.blocks;
	byteCount = this.byteCount;
	
	blockCount = this.blockCount;
	
	index = 0;
	s = this.s.s;

	Пока index < length Цикл 
		
		Если this.reset Тогда 
			
		  this.reset = Ложь;
		  
		  Если blocks.Количество() = 0 Тогда 
			  
			  blocks.Добавить(ПреведениеКДиапазону(this.blocks, this.block));
			  
		  Иначе
			  
		      blocks[0] = ПреведениеКДиапазону(this.blocks, this.block);
			  
		  КонецЕсли;
		  
		  Для i = 1 По blockCount Цикл 
			  
			  Если blocks.Количество() < i + 1 Тогда

				   blocks.Добавить(0);
				   
			  Иначе
				   
				   blocks[i] = 0;
				   
			  КонецЕсли;
			  			  
	      КонецЦикла;	
			
		КонецЕсли;
		
		Если notString Тогда
			
		 	i = this.start;
			
			Пока index < length И i < byteCount Цикл 
								
				blocks[ПобитовыйСдвигВправо(i, 2)] = ПреведениеКДиапазону(this.blocks,
					ПобитовоеИли(blocks[ПобитовыйСдвигВправо(i, 2)],
					ПобитовыйСдвигВлево(messagearray[index], this.SHIFT[ПобитовоеИ(i, 3)])));
													 
				i = i + 1;		
					
				index = index + 1;
					
			КонецЦикла;
			
		Иначе
			
			i = this.start; 
			
			Пока index < length и i < byteCount Цикл 
				
			
				code = КодСимвола(message, Сред(message, index, 1));
				
				Если code < 128 Тогда 
					
					blocks[пСдвигВПраво(i, 2)] = пИли(blocks[пСдвигВПраво(i, 2)],
						пСдвигВЛево(code, пИ(this.SHIFT[i + 1], 3)));
						
					i = i + 1;
					
				ИначеЕсли code < 2048 Тогда 
					
					 blocks[пСдвигВПраво(i, 2)] = пИли(blocks[пСдвигВПраво(i, 2)], 
						пСдвигВЛево(пИли(192, пСдвигВПраво(code, 6)), this.SHIFT[пИ(i + 1, 3)]));
					 
					 i = i + 1;
					 
				   	 blocks[пСдвигВПраво(i, 2)] = пИли(blocks[пСдвигВПраво(i, 2)],
					 	пСдвигВЛево(пИли(128, пИ(code, 63)), this.SHIFT[пИ(i + 1, 3)]));
						
					 i = i + 1;
						
				ИначеЕсли code < 55296 Или code >= 57344 Тогда 
					
					 blocks[пСдвигВПраво(i, 2)] = пИли(blocks[пСдвигВПраво(i, 2)], 
					 	пСдвигВЛево(пИли(224, пСдвигВПраво(code, 12)), this.SHIFT[пИ(i + 1, 3)]));
						
					 i = i + 1;
						
			         blocks[пСдвигВПраво(i, 2)] = пИли(blocks[пСдвигВПраво(i, 2)],
					 	пСдвигВЛево(пИли(128, пИ(пСдвигВПраво(code, 6), 63)), this.SHIFT[пИ(i + 1, 3)]));
					 
					 i = i + 1;
					 
			         blocks[пСдвигВПраво(i, 2)] = пИли(blocks[пСдвигВПраво(i, 2)], 
					 	пСдвигВЛево(пИли(128, пИ(code, 63)), this.SHIFT[пИ(i + 1, 3)]));
					 
					 i = i + 1;
					 
				Иначе 
					
					 index = index + 1;
					
					 code = 65536 + пИли(пСдвигВЛево(пИ(code, 1023), 10), пИ(Символ(Сред(message, index, 1)), 1023));
					 
					 blocks[пСдвигВЛево(i, 2)] = пИли(blocks[пСдвигВЛево(i, 2)], 
						пСдвигВЛево(пИли(240, пСдвигВПраво(code, 18)), this.SHIFT[пИ(i + 1 , 3)]));
					 
					 i = i + 1;
					 
					 blocks[пСдвигВПраво(i, 2)] = пИли(blocks[пСдвигВПраво(i, 2)], 
					    пСдвигВЛево(пИ(128, пИ(пСдвигВПраво(code, 12), 63)), this.SHIFT[пИ(i + 1, 3)]));
						
					 i = i + 1;
					
					 blocks[пСдвигВПраво(i, 2)] = пИли(blocks[пСдвигВПраво(i, 2)], 
					    пСдвигВЛево(пИ(128, пИ(пСдвигВПраво(code, 6 ), 63)), this.SHIFT[пИ(i + 1, 3)]));
						
					 i = i + 1;

					 blocks[пСдвигВПраво(i, 2)] =  пИли(blocks[пСдвигВПраво(i, 2)], 
						пСдвигВЛево(пИли(128, пИ(code, 63)), this.SHIFT[пИ(i + 1, 3)]));
						
					 i = i + 1;
					 
				КонецЕсли;
					
				
				index = index + 1;
			
			КонецЦикла;
			
		КонецЕсли;
		
		Если this.Свойство("lastByteIndex") Тогда 
			
			this.lastByteIndex = i;	
			
		Иначе
			
			this.Вставить("lastByteIndex", i);
			
		КонецЕсли;
			
		
		Если i >= byteCount Тогда 
						
		    this.start = i - byteCount;
		    this.block = blocks[blockCount];
			
			
			Для i = 0 По blockCount Цикл 
				
				s[i] = ПобитовоеИсключительноеИли(s[i], blocks[i]);
				
			КонецЦикла;
		
			f(this.s, this.RC);
			
			this.reset = Истина;

		Иначе 
			
			this.start = i;

		КонецЕсли;
		
		
	КонецЦикла;
	
	this.Вставить("array_t", Keccakfinalize(this));
	
	Возврат this;
	
КонецФункции

#КонецОбласти
///////////////////////////////////////////////////////////////////////////////////

