///////////////////////////////////////////////////////////////////////////////////
//Модуль - Типизированные Массивы Клиент Сервер
//
// MIT License Copyright (c) 2020 AcrylPlatform.
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights 
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell 
// copies of the Software, and to permit persons to whom the Software 
// is furnished to do so, subject to the following conditions:
// The above copyright notice and this permission notice shall be 
// included in all copies or substantial portions of the Software.
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
// EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, 
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT 
// SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, 
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, 
// ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE 
// OR OTHER DEALINGS IN THE SOFTWARE.
//
///////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

///////////////////////////////////////////////////////////////////////////////////
#Область ТипизированныеМассив

// Функция - Uint8 array
//
// Параметры:
//  ИмяМассива			 - Массив - Имя массива с данными
//  КоличествоЭлементов	 - Число  - Количество элементов в массиве с данными
// 
// Возвращаемое значение:
// Структура  - Содержание структуры: массив с данными, разрядность и диапазноны чисел 
//
Функция Uint8Array(ИмяМассива = "мДанные", КоличествоЭлементов = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	мДанные = Новый Массив;
	
	Если КоличествоЭлементов <> Неопределено Тогда 
	
		Для сч = 0 По КоличествоЭлементов - 1 Цикл
			
			мДанные.Добавить(0);	
			
		КонецЦикла;
			
	КонецЕсли;
	
	Результат.Вставить(ИмяМассива, мДанные);
	Результат.Вставить("ДиапазонЗначенийМин", 0);
	Результат.Вставить("ДиапазонЗначенийМакс", 255);
	Результат.Вставить("Разярдность", 8);
	
	Возврат Результат;
	
КонецФункции

// Функция - Uint16 array
//
// Параметры:
//  ИмяМассива			 - Массив - Имя массива с данными
//  КоличествоЭлементов	 - Число  - Количество элементов в массиве с данными
// 
// Возвращаемое значение:
// Структура  - Содержание структуры: массив с данными, разрядность и диапазноны чисел 
//
Функция Uint16Array(ИмяМассива = "мДанные", КоличествоЭлементов = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	мДанные = Новый Массив;
	
	Если КоличествоЭлементов <> Неопределено Тогда 
	
		Для сч = 0 По КоличествоЭлементов - 1 Цикл
			
			мДанные.Добавить(0);	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат.Вставить(ИмяМассива, мДанные);
	Результат.Вставить("ДиапазонЗначенийМин", 0);
	Результат.Вставить("ДиапазонЗначенийМакс", 65535);
	Результат.Вставить("Разярдность", 16);
	
	Возврат Результат;
	
КонецФункции

// Функция - Uint32 array
//
// Параметры:
//  ИмяМассива			 - Массив - Имя массива с данными
//  КоличествоЭлементов	 - Число  - Количество элементов в массиве с данными
// 
// Возвращаемое значение:
// Структура  - Содержание структуры: массив с данными, разрядность и диапазноны чисел 
//
Функция Uint32Array(ИмяМассива = "мДанные", КоличествоЭлементов = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	мДанные = Новый Массив;
	
	Если КоличествоЭлементов <> Неопределено Тогда 
	
		Для сч = 0 По КоличествоЭлементов - 1 Цикл
			
			мДанные.Добавить(0);	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат.Вставить(ИмяМассива, мДанные);
	Результат.Вставить("ДиапазонЗначенийМин", 0);
	Результат.Вставить("ДиапазонЗначенийМакс", 4294967295);
	Результат.Вставить("Разярдность", 32);
	
	Возврат Результат;
	
КонецФункции

// Функция - Int32 array
//
// Параметры:
//  ИмяМассива			 - Массив - Имя массива с данными
//  КоличествоЭлементов	 - Число  - Количество элементов в массиве с данными
// 
// Возвращаемое значение:
// Структура  - Содержание структуры: массив с данными, разрядность и диапазноны чисел 
//
Функция Int32Array(ИмяМассива = "мДанные", КоличествоЭлементов = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	мДанные = Новый Массив;
	
	Если КоличествоЭлементов <> Неопределено Тогда 
	
		Для сч = 0 По КоличествоЭлементов - 1 Цикл
			
			мДанные.Добавить(0);	
			
		КонецЦикла;

	КонецЕсли;
	
	Результат.Вставить(ИмяМассива, мДанные);
	Результат.Вставить("ДиапазонЗначенийМин", -2147483648);
	Результат.Вставить("ДиапазонЗначенийМакс", 2147483647);
	Результат.Вставить("Разярдность", 32);
	
	Возврат Результат;
	
КонецФункции

// Функция - Float64 array
//
// Параметры:
//  ИмяМассива			 - Массив - Имя массива с данными
//  КоличествоЭлементов	 - Число  - Количество элементов в массиве с данными
// 
// Возвращаемое значение:
// Структура  - Содержание структуры: массив с данными, разрядность и диапазноны чисел 
//
Функция Float64Array(ИмяМассива = "мДанные", КоличествоЭлементов = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	мДанные = Новый Массив;
	
	Если КоличествоЭлементов <> Неопределено Тогда 
	
		Для сч = 0 По КоличествоЭлементов - 1 Цикл
			
			мДанные.Добавить(0);	
			
		КонецЦикла;

	КонецЕсли;
	
	Результат.Вставить(ИмяМассива, мДанные);
	Результат.Вставить("ДиапазонЗначенийМин", 5 * (pow(10, -324)));
	Результат.Вставить("ДиапазонЗначенийМакс", 1.8 * (pow(10, 308)));
	Результат.Вставить("Разярдность", 64);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
///////////////////////////////////////////////////////////////////////////////////
#Область РаботаСТипизированнымиМассивами

// Функция - Получить данные массива
//
// Параметры:
//  ТипизированныйМассив - Структуа - Описание типизированного массива
// 
// Возвращаемое значение:
// Массив  -  Массив данных из структуры
//
Функция ПолучитьДанныеМассива(ТипизированныйМассив) Экспорт
	
	Результат = Новый Структура;
	
	Для Каждого ЭлементСтруктуры из ТипизированныйМассив Цикл
		
		Если ТипЗнч(ЭлементСтруктуры.Значение)  = ТипЗнч(Новый Массив) Тогда
			
			Результат.Вставить("Имя", ЭлементСтруктуры.Ключ);
			Результат.Вставить("Данные", ЭлементСтруктуры.Значение);
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция - Преведение к диапазону
//
// Параметры:
//  ТипизированныйМассив - Структура	- Описание типизированного массива
//  Число				 - Число  		- Исходное число
// 
// Возвращаемое значение:
// Число  -  Соответсвующие диапазону массива
//
Функция ПреведениеКДиапазону(Знач ТипизированныйМассив, Знач Число) Экспорт 
	
	Если Число = Неопределено Тогда 
		
		Число = 0;
		
	КонецЕсли;
	
	Если ТипизированныйМассив.ДиапазонЗначенийМин <= Число И
		ТипизированныйМассив.ДиапазонЗначенийМакс >= Число Тогда
		
		Возврат Число;
		               
	ИначеЕсли ТипизированныйМассив.ДиапазонЗначенийМин = 0 Тогда 
		
		двЧисло = Crypt_ОбщегоНазначенияКлиентСевер.ДвоичноеПредставлениеДесятичногоЧисла(Число, ТипизированныйМассив.Разярдность);
		
		Возврат Crypt_ОбщегоНазначенияКлиентСевер.ДесятичноеПредставлениеДвоичногоЧисла(Прав(двЧисло, ТипизированныйМассив.Разярдность));
		
	ИначеЕсли ТипизированныйМассив.ДиапазонЗначенийМин < 0 Тогда 	
		
		двЧисло = Crypt_ОбщегоНазначенияКлиентСевер.ДвоичноеПредставлениеДесятичногоЧисла(Число, ТипизированныйМассив.Разярдность);
		
		Возврат Crypt_ОбщегоНазначенияКлиентСевер.ДесятичноеПредставлениеДвоичногоЧисла(Прав(двЧисло, ТипизированныйМассив.Разярдность), Ложь);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
///////////////////////////////////////////////////////////////////////////////////

#КонецОбласти
////////////////////////////////////////////////////////////////////////////////////